import React from 'react';
import './TermsPage.css';

const TermsPage = () => {
  return (
    <div className='terms_page' >

<div className="app_container">
        <h1 className="category_headline">   الشروط و الأحكام </h1>

        <div className="mt-3"></div>
        <div className="terms_div">

            <p className="term_para">
            
                <p>مقدمة :</p>
                
من خلال زيارتك\nموقعنا و/أو شراء شيء منا، فإنك تكون قد اشتركت في “خدمتنا” ووافقت على أن تكون\nخاضعًا للشروط والأحكام التالية (شروط الخدمة، الشروط)، بما فيها تلك الشروط\nوالأحكام والسياسات الإضافية المذكورة هنا أو التي ترتبط بالموقع عن طريق رابط. تنطبق\nشروط الخدمة هذه على جميع مستخدمي الموقع، بمن فيهم المتصفحون والموردون والعملاء\nوالتجار و/أو المساهمون في محتوى الموقع.

أي جزء من أجزاء\nشروط الخدمة هذه من خلال نشر تحديثات و/أو تغييرات على موقعنا الإلكتروني. إنك من\nيتحمل مسئولية الاطلاع على هذه الصفحة بصورة دورية لكي ترى ما إذا كانت هناك\nتغييرات جديدة، كما أن مواصلة استخدامك أو دخولك الموقع الإلكتروني، بعد نشرنا\nلحدوث أية تغييرات جديدة، يتضمن موافقتك على هذه التغييرات.


            </p>

            <p className="term_para">
            
                <p>المادة 1 – شروط عامة  :</p>
            
أي سياسات أو أحكام\nمذكورة في قسم الأسئلة المتكررة الموجودة في الرابط — تعتبر جزء لا يتجزأ من شروط\nالخدمة و مكمّلة و مفسّرة لها.

نحتفظ بحقنا في رفض\nتقديم الخدمة لأي كان لأي سبب من الأسباب وفي أي وقت نراه مناسبًا.

عليك أن تتفهم أن\nبياناتك (والتي لا تشمل معلومات بطاقاتك الائتمانية) قد تُنقل دون تشفير وقد تخضع\nإلى: (أ) النقل ما بين شبكات مختلفة على شبكة الإنترنت، و (ب) تغيرات من أجل\nتوفيقها وتعديلها بما يناسب المتطلبات الفنية للشبكات أو الأجهزة المتصلة فيما\nبينها، إلا أن معلومات البطاقات الائتمانية دائمًا ما يتم تشفيرها قبل تحويلها عبر\nالإنترنت.

لا يمكنك أن تعيد\nاستخدام أو أن تعيد إنشاء أو أن تنسخ أو أن تبيع أو أن تعيد بيع أو أن تستغل أي\nجزء من خدمات أو محتويات الموقع، أو أن تستخدم الخدمة أو أن تدخل الخدمة أو بيانات\nأي من مستخدمي الموقع دون الحصول على إذن كتابي منا.

إن العناوين\nالمستخدمة في هذا الاتفاق قد أُدرجت كأمثلة فقط، ولا تقتصر عليها هذه الشروط أو\nتتأثر بها.


            </p>

            <p className="term_para">
            
                <p>المادة 2 – شروط المتجر\nالإلكتروني :</p>
            

                عبر موافقتك على\nشروط الخدمة هذه، فإنك تُقر بأنك قد بلغت سن الرشد في دولتك أو المحافظة التي تعيش\nبها، وبأنك قد أعطيتنا موافقتك على أن يستخدم أي ممن تعولهم هذا الموقع. من غير المسموح\nلك أن تستخدم أياً من منتجاتنا لأغراض مخالفة للقانون أو غير مسموح بها، ومن غير\nالمسموح لك، خلال الاستفادة من الخدمة، أن تنتهك أية قوانين معمول بها في المحافظة\nالقضائية التي تعيش بها (بما فيها، وليست مقصورة عليها، قوانين حماية الملكية\nالفكرية).

يجب عليك ألا تنقل\nأية فيروسات أو أية ملفات مشفرة ذات طبيعة تدميرية. أي خرق لأي من بنود هذا\nالاتفاق من شأنه أن يؤدي إلى الإيقاف الفوري لتقديم الخدمات لك.

في أي\nوقت نراه مناسبًا، ولكننا غير ملتزمين بتحديث أية معلومات على موقعنا، وعليك أن\nتوافق على تحمل مسؤولية مراجعة أية تغييرات تحدث في موقعنا.

 


            </p>

            <p className="term_para">
            
                <p>المادة 3– تعديلات الخدمة\nوالأسعار :</p>
            

              
من حقنا تغيير\nأسعار منتجاتنا في أي وقت دون إشعار مسبق.

كما نحتفظ بحقنا في\nتعديل الخدمة أو إيقافها في أي وقت (أو أي جزء من محتويات الموقع) دون إشعار مسبق\nوأي وقت نراه مناسبًا.

كما أننا لن نكون\nعرضة للمساءلة القانونية لك أو لأي طرف آخر بموجب أية تعديلات أو تغييرات في\nالأسعار أو تعليق الخدمة أو إيقافها.

 


            </p>
        </div>
        
        </div>
    </div>
  )
}

export default TermsPage